#define _CRT_SECURE_NO_WARNINGS 1

//#include<stdio.h>
//int main()
//{
//	int a = 5 / 2;//商2余1
//	printf("%d\n", a);//2
//
//	int b = 5 % 2;
//	printf("%d\n", b);//1
//
//	double c = 5 / 2.0;
//	printf("%lf\n", c);//2.500000
//
//	//double c = 5 % 2.0;//err
//
//	return 0;
//}
////除了%之外，其他的几个算数操作符可以用于整数和浮点型
////对于/操作符，如果两个操作数都为整数，执行整数除法；而只要有浮点数，执行的就是浮点数除法
////%操作符的两个操作数必须为整数，返回的是整除之后的余数

//#include<stdio.h>
//int main()
//{
//	int a = 16;
//	int b = a >> 2;
//	printf("%d\n", b);//4
//	//00000000000000000000000000010000--16
//	//00000000000000000000000000000100--4
//
//	int n = -1;
//	int m = n << 1;
//	printf("m=%d\n", m);//-2
//	
//	int c = 5;
//	int d = c << 1;
//	printf("%d\n", d);//10
//	//000000000000000000000000000000101--5
//	//000000000000000000000000000001010--10
//
//	return 0;
//}
////>>--右移操作符：移动的是二进制位
////1.算数右移：右边丢弃，左边补原符号位，正数补0，负数补1
////2.逻辑右移：右边丢弃，左边补0
////右移有除二的效果
//
////整数的二进制表示有：原码、反码、补码
////存储到内存的是补码
//// 正整数的原码、反码、补码是相同的
//// 100000000000000000000000000001-原码
//// 111111111111111111111111111110-反码 符号位不变，其他位按位取反
//// 111111111111111111111111111111-补码 反码加一
//
////左移操作符：左边丢弃，右边补0；  
////左移有乘二的效果
//
////警告：对于移位运算符，不要移动负数位，这个是标准未定义的
//int num=0;
//num >> -1;//error
//
////移位操作符只能作用于整数

//#include<stdio.h>
//int main()
//{
//	int a = 3;
//	int b = 5;
//	int c = a & b;
//	printf("%d\n", c);//1
//	//00000000000000000000000000000011--3
//	//00000000000000000000000000000101--5
//	//00000000000000000000000000000001--1
//
//	int d = a | b;
//	printf("%d\n", d);//7
//	//00000000000000000000000000000011--3
//	//00000000000000000000000000000101--5
//	//00000000000000000000000000000111--7
//
//	int e = a ^ b;
//	printf("%d\n", e);//6
//	//00000000000000000000000000000011--3
//	//00000000000000000000000000000101--5
//	//00000000000000000000000000000110--6
//
//	return 0;
//}
////&-按位（二进制位）与
////|-按位（二进制位）或
////^-按位（二进制位）异或，相同为0，不同为1
////一定要用补码进行运算

////实现两个数的交换
//#include<stdio.h>
//int main()
//{
//	int a = 3;
//	int b = 5;
//
//	////方法一：临时变量
//	//int tmp = 0;
//	//printf("before:a=%d,b=%d\n", a, b);
//	//tmp = a;
//	//a = b;
//	//b = tmp;
//	//printf("after:a=%d,b=%d\n", a, b);
//
//	////方法二：加减法-可能会溢出
//	//a = a + b;
//	//b = a - b;
//	//a = a - b;
//	//printf("%d ,%d \n", a, b);
//
//	//方法三：异或
//	a = a ^ b;
//	b = a ^ b;
//	a = a ^ b;
//	printf("%d ,%d \n", a, b);
//
//	return 0;
//}

////编写代码，求一个整数存储在内存中的二进制中1的个数
//#include<stdio.h>
//int main()
//{
//	int num = 0;
//	int count = 0;
//	scanf("%d", &num);
//
//	//方法二：
//	int i = 0;
//	for (i = 0; i < 32; i++)
//	{
//		if (1 == ((num >> i) & 1))	
//		    count++;
//	}
//
//	//统计补码中有几个1
//	//方法一：
//	/*while (num)
//	{
//		if (num % 2 == 1)
//		{
//			count++;
//			num = num / 2;
//		}
//	}*/
//
//	printf("%d\n", count);
//	return 0;
//}

#include<stdio.h>
int main()
{
	int a = 10;
	char c = 'r';
	char* p = &c;
	int arr[10] = { 0 };
	printf("%d\n", sizeof(a));//4
	printf("%d\n", sizeof a);
	printf("%d\n", sizeof(int));
	//sizeof后面是类型时，（）不能省略

	printf("%d\n", sizeof(c));//1
	printf("%d\n", sizeof(char));

	printf("%d\n", sizeof(p));//4或8
	printf("%d\n", sizeof(char*));

	printf("%d\n", sizeof(arr));//40
	printf("%d\n", sizeof(int[10]));
	//数组也是有类型的，去掉数组名就是数组的类型

	return 0;
}
//sizeof计算的是变量所占内存空间的大小，单位是字节



